import Outline from "../components/Outline";
import classes from "./BookDetail.module.css";
import Comment from "../components/Comment";

const BookDetail = () => {
  return (
    <>
      <Outline />
      <div className={classes.mainWrapper}>
        <div className={classes.title}>درباره کتاب</div>
        <div className={classes.description}>
          اگر روزی یا شبی اهریمنی در تنهاترین تنهایی‌ات بر تو ظاهر شود و بگوید
          «این زندگی را که اکنون مشغول زیستنش هستی و آن را زیسته‌ای باید یک‌بار
          دیگر و بی‌شمار بار دیگر زندگی کنی و در آن هیچ‌چیز تازه نخواهد بود و
          همه‌ی رنج‌ها و خوشی‌ها و همه‌ی افکار و حسرت‌ها و همه‌ی چیزهای
          خُردوکلان زندگی‌ات دوباره به تو بازخواهد گشت، به همان ترتیب و تسلسل ــ
          حتی این عنکبوت و این مهتاب میان درختان و حتی این لحظه و خود من.
          ساعت‌شنیِ جاودانِ وجود بلاانقطاع سروته می‌شود و تو هم همراهش، ای ذره‌ی
          غبار!» آیا خود را بر زمین نمی‌افکنی و دندان نمی‌سایی و نفرین نمی‌کنی
          اهریمنی را که این‌ها را بر زبان آورده؟… هر چه باداباد هیچ‌کس هیچ‌وقت
          به من فکر نمی‌کرد. حالا که مُرده‌ام، فکرم به‌شدت درگیر چیزهایی شبیه
          این‌هاست: چه تعداد از تصمیمات مهم زندگی‌ام را فقط به این خاطر گرفته
          بودم تا کسانی که حتی متوجه حضورم نشده بودند درباره‌ام بد فکر نکنند؛
          چه‌قدر له‌له زده بودم برای خوش‌آمد کسانی که از آن‌ها خوشم نمی‌آمد فقط
          چون می‌ترسیدم بیزاری از من مسری باشد و به کل جمعیت سرایت کند؛ و اگر ــ
          حقیقت تأسف‌بار این‌جاست ــ همه‌ی بخت‌برگشتگی‌هایم منحصر به خودم بودند
          و کسی درگیرشان نمی‌شد، مشکل چندانی با آن‌ها نداشتم. فقط بابت این‌ها
          غصه نمی‌خورم؛ چرا بیشتر دنیای‌مان را ندیده بودم؟ چرا چتربازی یا
          ماجراجویی جنسی نکردم؟ دقیقاً چرا این‌قدر از لمس یک ذَکَر متنفر بودم؟
          ناهم‌جنس‌خواه بودنم چه اهمیتی داشت؟ اکثر گیاه‌خوارها ماهی نمی‌خورند؟ و
          چرا این‌قدر مطمئن بودم که هر جور باور به ماوراءالطبیعه معنایش رجعتی
          شرم‌آور است به دوران پیشاعلم؟ البته که من هم ترس‌های غیرمنطقی خودم را
          داشتم: ترس از مانکن‌ها و شیب‌های تند و خیره شدن دیگران به خودم، ولی
          هیچ‌وقت از تاریکی نمی‌ترسیدم، یا از مُرده‌ها، یا هر چیزِ مربوط به
          دنیای پس از مرگ. برای من بهشت رؤیایی کودکانه بود و برزخ استعاره‌ای
          آشکار و جهنم صرفاً معتبر روی زمین، و حتی تصور یک روح جاودان فقط راهی
          بود برای اجتناب از رودررویی با سفر بی‌بازگشت‌مان به ناکجا. خجالت‌آور
          است که آدم تا چه حد می‌تواند در اشتباه باشد.
        </div>
        <div className={classes.commentsBox}>
          <div className={classes.commentsHead}>نظرات کاربران</div>
          <Comment />
          <Comment />
          <Comment />
          <Comment />
        </div>
      </div>
    </>
  );
};

export default BookDetail;
